<a href="https://colab.research.google.com/github/MRS88/AI_course/blob/master/%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8F_03_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_1/Pandas_1_%D0%A0%D0%B0%D0%B7%D0%B1%D0%BE%D1%80_%D0%B4%D0%BE%D0%BC%D0%B0%D1%88%D0%BD%D0%B5%D0%B3%D0%BE_%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F_Light_%D0%A3%D0%BD%D0%B8%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82_%D0%98%D1%81%D0%BA%D1%83%D1%81%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE_%D0%98%D0%BD%D1%82%D0%B5%D0%BB%D0%BB%D0%B5%D0%BA%D1%82%D0%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd #Подключаем библиотеку pandas для всего занятия

### Задача 1
Загрузите базу температур любым удобным способом. Выведите базу. Посчитайте число пустых записей в столбце State.

**Решение:**

In [ ]:
#Подключаем Google Диск
from google.colab import drive 
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
4/4AHrNwW_9H8Phphm4Dm72z7w1vO9CCNHagvTVWNg4mPvc1Q3C_nsBAM
Mounted at /content/drive

In [ ]:
df = pd.read_csv('/content/drive/My Drive/Базы/city_temperature.csv') #Читаем базу

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
df #Смотрим результат

                Region  Country  ...  Year AvgTemperature
0               Africa  Algeria  ...  1995           64.2
1               Africa  Algeria  ...  1995           49.4
2               Africa  Algeria  ...  1995           48.8
3               Africa  Algeria  ...  1995           46.4
4               Africa  Algeria  ...  1995           47.9
...                ...      ...  ...   ...            ...
2906322  North America       US  ...  2013           82.4
2906323  North America       US  ...  2013           81.6
2906324  North America       US  ...  2013           84.2
2906325  North America       US  ...  2013           83.8
2906326  North America       US  ...  2013           83.6

[2906327 rows x 8 columns]

In [ ]:
df.State.isna().sum() #Считаем число пустых записей в столбце State

1450990

### Задача 2
Заполните пустые данные в базе словом "No". Запишите результат в ту же переменную. Выведите ее на экран.

**Решение:**

In [ ]:
df = df.fillna("No") #Заполняем пустые записи словом "No"

In [ ]:
df

                Region  Country  ...  Year AvgTemperature
0               Africa  Algeria  ...  1995           64.2
1               Africa  Algeria  ...  1995           49.4
2               Africa  Algeria  ...  1995           48.8
3               Africa  Algeria  ...  1995           46.4
4               Africa  Algeria  ...  1995           47.9
...                ...      ...  ...   ...            ...
2906322  North America       US  ...  2013           82.4
2906323  North America       US  ...  2013           81.6
2906324  North America       US  ...  2013           84.2
2906325  North America       US  ...  2013           83.8
2906326  North America       US  ...  2013           83.6

[2906327 rows x 8 columns]

### Задание 3

При помощи метода Pandas определите число уникальных записей в столбцах Country, City, Year.

**Решение:**

In [ ]:
df.Country.nunique() #Считаем число уникальных записей в столбце Country

125

In [ ]:
df.Year.nunique() #Считаем число уникальных записей в столбце Year

28

In [ ]:
df.City.nunique() #Считаем число уникальных записей в столбце City

321

### Задача 4
При помощи библиотеки Pandas выведите строки, где в столбце Country встречается страна Russia.

При помощи метода Pandas отдельно выведите число элементов в этой выборке.

**Решение:**

In [ ]:
df[df.Country == 'Russia'] #Смотрим записи для страны 'Russia'

        Region Country State     City  Month  Day  Year  AvgTemperature
878256  Europe  Russia    No   Moscow      1    1  1995            32.3
878257  Europe  Russia    No   Moscow      1    2  1995            31.7
878258  Europe  Russia    No   Moscow      1    3  1995            26.8
878259  Europe  Russia    No   Moscow      1    4  1995            15.9
878260  Europe  Russia    No   Moscow      1    5  1995            23.8
...        ...     ...   ...      ...    ...  ...   ...             ...
890743  Europe  Russia    No  Yerevan     10   27  2003            53.3
890744  Europe  Russia    No  Yerevan     10   28  2003            51.9
890745  Europe  Russia    No  Yerevan     10   29  2003            54.3
890746  Europe  Russia    No  Yerevan     10   30  2003            44.3
890747  Europe  Russia    No  Yerevan     10   31  2003            40.1

[12492 rows x 8 columns]

In [ ]:
df[df.Country == 'Russia'].size #Считаем число элементов в выборке

99936

### Задача 5
Создайте новый столбец температур, в котором будут записаны те же значения AvgTemperature, но в градусах Цельсия (исходная единица измерения - градусы Фаренгейта).

**Решение:**

In [ ]:
df['AvgTemperatureCelsius'] = (df['AvgTemperature']  - 32) / 1.8 #По формуле переводим значения из градусов Фаренгейта в градусы Цельсия

In [ ]:
df #Смотрим результат

                Region  Country  ... AvgTemperature AvgTemperatureCelsius
0               Africa  Algeria  ...           64.2             17.888889
1               Africa  Algeria  ...           49.4              9.666667
2               Africa  Algeria  ...           48.8              9.333333
3               Africa  Algeria  ...           46.4              8.000000
4               Africa  Algeria  ...           47.9              8.833333
...                ...      ...  ...            ...                   ...
2906322  North America       US  ...           82.4             28.000000
2906323  North America       US  ...           81.6             27.555556
2906324  North America       US  ...           84.2             29.000000
2906325  North America       US  ...           83.8             28.777778
2906326  North America       US  ...           83.6             28.666667

[2906327 rows x 9 columns]